<?php
namespace ResourceCatalog\Model;

interface IUserGroup extends IUserGroupIdentify
{
    const ID = array(
        'NULL' => 0,
        'FGW' => 1,//(1, '离石区发展和改革局', '区发改局',  1
        'XCB' => 2,//(2, '离石区委宣传部', '区宣传部', 1
        'SCJGJ' => 3,//(3, '离石区市场监督管理局', '区市场监管局',1
        'QZZB' => 4,//(4, '离石区委组织部', '区组织部', 1
        'QJRB' => 5,//(5, '离石区政府经济研究中心（离石区金融事务服务中心）', '区金融办', 11 吕梁 array
        'QZFW' => 6,//(6, '离石区委政法委', '区政法委', 1
        'QBB' => 7,//(7, '离石区委编办', '区编办', 1
        'QTW' => 8,//(8, '共青团离石区委', '区团委', 1
        'QKJJ' => 9,//(9, '离石区教育科技局', '区教科局', 1
        'QGXJ' => 10,//(10, '离石区工业和信息化局', '区工信局', 1
        'QMZJ' => 11,//(11, '离石区民政局', '区民政局', 1
        'QSFJ' => 12,//(12, '离石区司法局', '区司法局', 1
        'QCZJ' => 13,//(13, '离石区财政局', '区财政局', 1
        'QRSJ' => 14,//(14, '离石区人力资源和社会保障局', '区人社局', 1
        'QZRZYJ' => 15,//(15, '离石区自然资源局', '区自然资源局', 1
        'QZJJ' => 16,//(16, '离石区住房和城乡建设局', '区住建局', 1
        'QJTYSJ' => 17,//(17, '离石区交通运输局', '区交通运输局', 1
        'QNYNCJ' => 18,//(18, '离石区农业农村局', '区农业农村局', 1
        'QLYJ' => 19,//(19, '离石区林业局', '区林业局', 1
        'QWLJ' => 20,//(20, '离石区文化和旅游局', '区文旅局', 1
        'QWJJ' => 21,//(21, '离石区卫生健康和体育局', '区卫健局', 1
        'QYJJ' => 22,//(22, '离石区应急管理局', '区应急局', 1
        'QTJJ' => 23,//(23, '离石区统计局', '区统计局', 1
        'QYBJ' => 24,//(24, '离石区医疗保障局', '区医保局', 1
        'QXZSPJ' => 25,//(25, '离石区行政审批服务管理局', 1
        'QNYJ' => 26,//(26, '离石区能源局', '区能源局', 1
        'QFPB' => 27,//(27, '离石区扶贫办', '区扶贫办', 11 吕梁
        'QRMFY' => 28,//(28, '离石区人民法院', '区人民法院', 1
        'QJCY' => 29,//(29, '离石区人民检察院', '区检察院', 1
        'QGAJ' => 30,//(30, '吕梁市公安局离石分局', '区公安局', 1
        'QSTJ' => 31,//(31, '吕梁市生态环境局离石分局', '区生态局', 1
        'QSWJ' => 32,//(32, '国家税务总局吕梁市离石区税务局', '区税务局' 1
    );
}
